# ProDS Associate 실기 대비 3

# Dataset_11

In [ ]:
# =============================================================================
# =============================================================================
# # 문제 11 유형(DataSet_11.csv 이용)

# 구분자 : comma(“,”), 470 Rows, 4 Columns, UTF-8 인코딩

# 세계 각국의 행복지수를 비롯한 여러 정보를 조사한 DS리서치는
# 취합된 자료의 현황 파악 및 간단한 통계분석을 실시하고자 한다.

# 컬 럼 / 정 의 / Type
# Country / 국가명 / String
# Happiness_Rank / 당해 행복점수 순위 / Double
# Happiness_Score / 행복점수 / Double
# year / 년도 / Double
# =============================================================================
# =============================================================================

In [1]:
import pandas as pd

In [2]:
dataset11 = pd.read_csv('Dataset/Dataset_11.csv')

In [3]:
dataset11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 470 entries, 0 to 469
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          470 non-null    object
 1   Happiness_Rank   470 non-null    int64
 2   Happiness_Score  470 non-null    float64
 3   year             470 non-null    int64
dtypes: float64(1), int64(2), object(1)
memory usage: 14.8+ KB

## 1.

In [ ]:
# =============================================================================
# 1.분석을 위해 3년 연속 행복지수가 기록된 국가의 데이터를 사용하고자 한다. 
# 3년 연속 데이터가 기록되지 않은 국가의 개수는?
# - 국가명 표기가 한 글자라도 다른 경우 다른 국가로 처리하시오.
# - 3년 연속 데이터가 기록되지 않은 국가 데이터는 제외하고 이를 향후 분석에서
# 활용하시오.(답안 예시) 1
# =============================================================================

In [5]:
q1 = dataset11.pivot_table(index='Country', columns='year')['Happiness_Score']
q1

year          2015   2016   2017
Country
Afghanistan  3.575  3.360  3.794
Albania      4.959  4.655  4.644
Algeria      5.605  6.355  5.872
Angola       4.033  3.866  3.795
Argentina    6.574  6.650  6.599
...            ...    ...    ...
Venezuela    6.810  6.084  5.250
Vietnam      5.360  5.061  5.074
Yemen        4.077  3.724  3.593
Zambia       5.129  4.795  4.514
Zimbabwe     4.610  4.193  3.875

[166 rows x 3 columns]

In [9]:
q1.isna().sum(axis=1)

Country
Afghanistan    0
Albania        0
Algeria        0
Angola         0
Argentina      0
              ..
Venezuela      0
Vietnam        0
Yemen          0
Zambia         0
Zimbabwe       0
Length: 166, dtype: int64

In [10]:
q1.isna().sum(axis=1).sum()

28

In [ ]:
# (답) 28 -> 오답

In [ ]:
# 오답풀이

In [36]:
q1[q1.isna().sum(axis=1) > 0]

year                       2015   2016   2017  na_num
Country
Belize                      NaN  5.956  5.956       1
Central African Republic  3.678    NaN  2.693       1
Comoros                   3.956  3.956    NaN       1
Djibouti                  4.369    NaN    NaN       2
Hong Kong                 5.474  5.458    NaN       1
Hong Kong S.A.R. China      NaN    NaN  5.472       2
Laos                      4.876  4.876    NaN       1
Lesotho                   4.898    NaN  3.808       1
Mozambique                4.971    NaN  4.550       1
Namibia                     NaN  4.574  4.574       1
Oman                      6.853    NaN    NaN       2
Puerto Rico                 NaN  7.039    NaN       2
Somalia                     NaN  5.440  5.151       1
Somaliland Region           NaN  5.057    NaN       2
Somaliland region         5.057    NaN    NaN       2
South Sudan                 NaN  3.832  3.591       1
Suriname                  6.269  6.269    NaN       1
Swaziland                 4.867    NaN    NaN       2
Taiwan                    6.298  6.379    NaN       1
Taiwan Province of China    NaN    NaN  6.422       2

In [37]:
len(q1[q1.isna().sum(axis=1) > 0])

20

### 해설

In [11]:
dataset11.columns

Index(['Country', 'Happiness_Rank', 'Happiness_Score', 'year'], dtype='object')

In [12]:
# multi lable
q1 = pd.pivot_table(dataset11, index='Country', columns=['year'], 
                    values=['Happiness_Score'])
q1

            Happiness_Score
year                   2015   2016   2017
Country
Afghanistan           3.575  3.360  3.794
Albania               4.959  4.655  4.644
Algeria               5.605  6.355  5.872
Angola                4.033  3.866  3.795
Argentina             6.574  6.650  6.599
...                     ...    ...    ...
Venezuela             6.810  6.084  5.250
Vietnam               5.360  5.061  5.074
Yemen                 4.077  3.724  3.593
Zambia                5.129  4.795  4.514
Zimbabwe              4.610  4.193  3.875

[166 rows x 3 columns]

In [13]:
# 단일 label
q1 = pd.pivot_table(dataset11, index='Country', columns=['year'], 
                    values='Happiness_Score')
q1

year          2015   2016   2017
Country
Afghanistan  3.575  3.360  3.794
Albania      4.959  4.655  4.644
Algeria      5.605  6.355  5.872
Angola       4.033  3.866  3.795
Argentina    6.574  6.650  6.599
...            ...    ...    ...
Venezuela    6.810  6.084  5.250
Vietnam      5.360  5.061  5.074
Yemen        4.077  3.724  3.593
Zambia       5.129  4.795  4.514
Zimbabwe     4.610  4.193  3.875

[166 rows x 3 columns]

In [14]:
q1['na_num'] = q1.isna().sum(axis=1)

In [15]:
q1_2 = q1[q1['na_num'] < 1]

In [16]:
(q1['na_num'] > 0).sum()

20

In [ ]:
# (정답) 20

In [ ]:
# 추가로 해보기

In [31]:
q1_2

year          2015   2016   2017  na_num
Country
Afghanistan  3.575  3.360  3.794       0
Albania      4.959  4.655  4.644       0
Algeria      5.605  6.355  5.872       0
Angola       4.033  3.866  3.795       0
Argentina    6.574  6.650  6.599       0
...            ...    ...    ...     ...
Venezuela    6.810  6.084  5.250       0
Vietnam      5.360  5.061  5.074       0
Yemen        4.077  3.724  3.593       0
Zambia       5.129  4.795  4.514       0
Zimbabwe     4.610  4.193  3.875       0

[146 rows x 4 columns]

In [32]:
len(q1_2)

146

In [34]:
len(q1) - len(q1_2)

20

## 2.

In [ ]:
# =============================================================================
# 2.(1번 산출물을 활용하여) 2017년 행복지수와 2015년 행복지수를 활용하여 국가별
# 행복지수 증감률을 산출하고 행복지수 증감률이 가장 높은 3개 국가를 행복지수가
# 높은 순서대로 차례대로 기술하시오.
# 증감률 = (2017년행복지수−2015년행복지수)/2
# 
# - 연도는 년월(YEAR_MONTH) 변수로부터 추출하며, 연도별 매출금액합계는 1월부터
# 12월까지의 매출 총액을 의미한다. (답안 예시) Korea, Japan, China
# =============================================================================

### 해설

In [17]:
q2 = q1_2.drop(columns='na_num')

In [18]:
q2[2017]

Country
Afghanistan    3.794
Albania        4.644
Algeria        5.872
Angola         3.795
Argentina      6.599
               ...
Venezuela      5.250
Vietnam        5.074
Yemen          3.593
Zambia         4.514
Zimbabwe       3.875
Name: 2017, Length: 146, dtype: float64

In [20]:
# q2['2017'] => Error

In [21]:
q2['ratio'] = (q2[2017] - q2[2015]) / 2

In [22]:
q2['ratio'].nlargest(3).index

Index(['Latvia', 'Romania', 'Togo'], dtype='object', name='Country')

In [ ]:
# (정답) Latvia, Romania, Togo

## 3. ANOVA / F-Test & Tukey

In [ ]:
# =============================================================================
# 3.(1번 산출물을 활용하여) 년도별 행복지수 평균이 유의미하게 차이가 나는지
# 알아보고자 한다. 
# 이와 관련하여 적절한 검정을 사용하고 검정통계량을 기술하시오.
# - 해당 검정의 검정통계량은 자유도가 2인 F 분포를 따른다.
# - 검정통계량은 소수점 넷째 자리까지 기술한다. (답안 예시) 0.1234
# =============================================================================

# (참고)
# from statsmodels.formula.api import ols
# from statsmodels.stats.anova import anova_lm

### 해설

In [ ]:
# 집단 3개 -> 자유도 2
# ols 범주 변수 자동으로 분산분석
# 가정: 집단 내 등분산. 가정 만족 못하더라도 집단간 분산이 크면 가능
# 사후검정: 다중 검정

In [ ]:
# 방법 1. f_oneway

In [24]:
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm

In [27]:
q3 = dataset11[dataset11['Country'].isin(q1_2.index.values)]
q3

         Country  Happiness_Rank  Happiness_Score  year
0    Switzerland               1            7.587  2015
1        Iceland               2            7.561  2015
2        Denmark               3            7.527  2015
3         Norway               4            7.522  2015
4         Canada               5            7.427  2015
..           ...             ...              ...   ...
464         Togo             150            3.495  2017
465       Rwanda             151            3.471  2017
466        Syria             152            3.462  2017
467     Tanzania             153            3.349  2017
468      Burundi             154            2.905  2017

[438 rows x 4 columns]

In [45]:
# ' ', '-', '.' 변수명에 있으면 ols에서 사용 불가
# C(수치형변수): 범주형으로 인식 -> 지정하지 않으면 regression
anova = ols('Happiness_Score ~ C(year)', q3).fit()

In [46]:
anova_lm(anova)

             df      sum_sq   mean_sq         F    PR(>F)
C(year)     2.0    0.011198  0.005599  0.004277  0.995732
Residual  435.0  569.472307  1.309132       NaN       NaN

In [ ]:
# 통계량에 대한 분포(흩어진 정도)
# p-value
# 신뢰수준 1-a

In [ ]:
# (정답) 0.0042

In [40]:
# https://www.statsmodels.org/stable/search.html?q=pairwise_tukey#
from statsmodels.stats.multicomp import pairwise_tukeyhsd

In [41]:
q3_out = pairwise_tukeyhsd(q3['Happiness_Score'], q3['year'])
print(q3_out)

Multiple Comparison of Means - Tukey HSD, FWER=0.05
==================================================
group1 group2 meandiff p-adj  lower  upper  reject
--------------------------------------------------
  2015   2016  -0.0112   0.9 -0.3261 0.3038  False
  2015   2017   -0.001   0.9 -0.3159  0.314  False
  2016   2017   0.0102   0.9 -0.3048 0.3251  False
--------------------------------------------------

In [42]:
# q3_out => 안나옴

In [ ]:
# 방법 2. f_oneway

In [43]:
from scipy.stats import f_oneway

f_oneway(q1_2[2015], q1_2[2016], q1_2[2017])

F_onewayResult(statistic=0.004276725037689305, pvalue=0.9957324489944479)

In [44]:
f_oneway(q1_2[2015].values, q1_2[2016].values, q1_2[2017].values)

F_onewayResult(statistic=0.004276725037689305, pvalue=0.9957324489944479)

# Dataset_12

In [ ]:
# =============================================================================
# =============================================================================
# # 문제 12 유형(DataSet_12.csv 이용)

# 구분자 : comma(“,”), 5000 Rows, 7 Columns, UTF-8 인코딩

# 직장인의 독서 실태를 분석하기 위해서 수도권 거주자 5000명을
# 대상으로 간단한 인적 사항과 연간 독서량 정보를 취합하였다.

# 컬 럼 / 정 의 / Type
# Age / 나이 / String
# Gender / 성별(M: 남성) / String
# Dependent_Count / 부양가족 수 / Double
# Education_Level / 교육 수준 / String
# is_Married / 결혼 여부(1: 결혼) / Double
# Read_Book_per_Year / 연간 독서량(권) / Double
# Income_Range / 소득 수준에 따른 구간(A < B < C < D < E)이며 X는
# 정보 누락 / String
# =============================================================================
# =============================================================================

In [47]:
import pandas as pd

In [47]:
dataset12 = pd.read_csv('Dataset/Dataset_12.csv')

## 1.

In [ ]:
# =============================================================================
# 1.수치형 변수를 대상으로 피어슨 상관분석을 실시하고 연간 독서량과 가장
# 상관관계가 강한 변수의 상관계수를 기술하시오
# - 상관계수는 반올림하여 소수점 셋째 자리까지 기술하시오. (답안 예시) 0.123
# =============================================================================

## 2.

In [ ]:
# =============================================================================
# 2.석사 이상(석사 및 박사) 여부에 따라서 연간 독서량 평균이 유의미하게 다른지 가설
# 검정을 활용하여 알아보고자 한다. 독립 2표본 t검정을 실시했을 때 
# 유의 확률(pvalue)의 값을 기술하시오.
# - 등분산 가정 하에서 검정을 실시한다.
# - 유의 확률은 반올림하여 소수점 셋째 자리까지 기술한다. (답안 예시) 0.123
# =============================================================================

## 3. Multiple Regression

In [ ]:
# =============================================================================
# 3.독서량과 다른 수치형 변수의 관계를 다중선형회귀분석을 활용하여 알아보고자 한다. 
# 연간 독서량을 종속변수, 나머지 수치형 자료를 독립변수로 한다. 이렇게 생성한
# 선형회귀 모델을 기준으로 다른 독립변수가 고정이면서 나이만 다를 때, 40살은 30살
# 보다 독서량이 얼마나 많은가?
# - 학사 이상이면서 소득 구간 정보가 있는 데이터만 사용하여 분석을 실시하시오.
# - 결과값은 반올림하여 정수로 표기하시오. (답안 예시) 1
# =============================================================================

# (참고)
# from statsmodels.formula.api import ols

In [48]:
dataset12.columns

Index(['Age', 'Gender', 'Dependent_Count', 'Education_Level', 'is_Married',
       'Read_Book_per_Year', 'Income_Range'],
      dtype='object')

In [49]:
from statsmodels.formula.api import ols

In [50]:
var_list = dataset12.columns[dataset12.dtypes != 'object'].drop('Read_Book_per_Year')

In [53]:
form = 'Read_Book_per_Year~'+'+'.join(var_list)
form

'Read_Book_per_Year~Age+Dependent_Count+is_Married'

In [54]:
ols1 = ols(form, data=dataset12).fit()

In [55]:
ols1.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:     Read_Book_per_Year   R-squared:                       0.635
Model:                            OLS   Adj. R-squared:                  0.635
Method:                 Least Squares   F-statistic:                     2901.
Date:                Tue, 24 Aug 2021   Prob (F-statistic):               0.00
Time:                        15:58:58   Log-Likelihood:                -15057.
No. Observations:                5000   AIC:                         3.012e+04
Df Residuals:                    4996   BIC:                         3.015e+04
Df Model:                           3
Covariance Type:            nonrobust
===================================================================================
                      coef    std err          t      P>|t|      [0.025      0.975]
-----------------------------------------------------------------------------------
Intercept          -0.3231      0.445     -0.726      0.468      -1.195       0.549
Age                 0.7894      0.009     91.923      0.000       0.773       0.806
Dependent_Count    -0.1150      0.054     -2.116      0.034      -0.221      -0.008
is_Married         -0.0719      0.140     -0.514      0.608      -0.346       0.203
==============================================================================
Omnibus:                       72.985   Durbin-Watson:                   2.026
Prob(Omnibus):                  0.000   Jarque-Bera (JB):               76.307
Skew:                          -0.288   Prob(JB):                     2.69e-17
Kurtosis:                       3.183   Cond. No.                         303.
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

In [57]:
q3_ans = 0.7894 * 10
q3_ans

7.894

In [ ]:
# (정답) 8

# Dataset_13

In [ ]:
# =============================================================================
# =============================================================================
# # 문제 13 유형(DataSet13_train.csv / DataSet13_test.csv  이용)

# 구분자 : 
#     comma(“,”), 1500 Rows, 10 Columns, UTF-8 인코딩 / 
#     comma(“,”), 500 Rows, 10 Columns, UTF-8 인코딩

# 전국의 데이터 분석가 2000명을 대상으로 이직 관련 설문조사를 실시하였다. 
# 설문 대상자의 특성 및 이직 의사와 관련 인자를 면밀히 살펴보기 위해 다양한
# 분석을 실시하고자 한다.

# 컬 럼 / 정 의 / Type
# city_development_index / 거주 도시 개발 지수 / Double
# gender / 성별 / String
# relevent_experience / 관련 직무 경험 여부(1 : 유경험) / Integer
# enrolled_university / 대학 등록 형태(1 : 풀타임/파트타임) / Integer
# education_level / 교육 수준 / String
# major_discipline / 전공 / String
# experience / 경력 / Double
# last_new_job / 현 직장 직전 직무 공백 기간 / Double
# training_hours / 관련 직무 교육 이수 시간 / Double
# target / 이직 의사 여부(1 : 의사 있음) / Integer
# =============================================================================
# =============================================================================

In [58]:
import pandas as pd

In [60]:
dataset13_train = pd.read_csv('Dataset/Dataset_13_train.csv')
dataset13_test = pd.read_csv('Dataset/Dataset_13_test.csv')

## 1.

In [ ]:
# =============================================================================
# 1.(Dataset_13_train.csv를 활용하여) 경력과 최근 이직시 공백기간의 상관관계를 보고자
# 한다. 남여별 피어슨 상관계수를 각각 산출하고 더 높은 상관계수를 기술하시오.
# - 상관계수는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
# =============================================================================

In [85]:
train = dataset13_train.copy()
train.head()

,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target
0,0.516,Male,1,0,Graduate,STEM,13,5,36,1
1,0.766,Male,1,0,Graduate,STEM,12,5,264,0
2,0.920,Male,1,0,Masters,STEM,10,2,99,0
3,0.899,Male,1,0,Graduate,Business Degree,16,1,20,0
4,0.884,Male,1,0,Masters,STEM,20,5,39,0

In [63]:
train.corr()['experience']['target']

-0.17305295855881508

In [ ]:
# (답) -0.17 -> 오답: 남여별

In [ ]:
# 오답풀이

### 해설

In [100]:
df = pd.read_csv('Dataset/Dataset_13_train.csv')

In [101]:
df.groupby(["gender"])[["experience", "last_new_job"]].corr()

                     experience  last_new_job
gender
Female experience      1.000000      0.451898
       last_new_job    0.451898      1.000000
Male   experience      1.000000      0.411155
       last_new_job    0.411155      1.000000

In [ ]:
# (정답) 0.45

## 2.

In [ ]:
# =============================================================================
# 2.(Dataset_13_train.csv를 활용하여) 기존 데이터 분석 관련 직무 경험과 이직 의사가 서로
# 관련이 있는지 알아보고자 한다. 이를 위해 독립성 검정을 실시하고 해당 검정의 p-value를 기술하시오.
# - 검정은 STEM 전공자를 대상으로 한다.
# - 검정은 충분히 발달된 도시(도시 개발 지수가 제 85 백분위수 초과)에 거주하는 사람을
# 대상으로 한다.
# - 이직 의사 여부(target)은 문자열로 변경 후 사용한다.
# - p-value는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
# =============================================================================

In [80]:
import numpy as np

In [86]:
q2 = train.copy()

In [87]:
q2.columns

Index(['city_development_index', 'gender', 'relevent_experience',
       'enrolled_university', 'education_level', 'major_discipline',
       'experience', 'last_new_job', 'training_hours', 'target'],
      dtype='object')

In [88]:
q2['target'] = np.where(q2.target == 1, '1', '0')

In [89]:
q2.city_development_index

0       0.516
1       0.766
2       0.920
3       0.899
4       0.884
        ...
1495    0.920
1496    0.890
1497    0.920
1498    0.920
1499    0.802
Name: city_development_index, Length: 1500, dtype: float64

In [71]:
# q2.city_development_index.quantile()

0.91

In [90]:
q_85 = q2.city_development_index.quantile(q=0.85)
q_85

0.9200000000000002

In [91]:
q2.major_discipline.unique()

array(['STEM', 'Business Degree', 'Arts', 'Humanities', 'Other'],
      dtype=object)

In [92]:
stem = q2[q2.major_discipline == 'STEM']
len(stem)

1290

In [93]:
stem_85 = stem[stem.city_development_index > q_85]
len(stem_85)

145

In [94]:
q2.target.unique()

array(['1', '0'], dtype=object)

In [95]:
q2.relevent_experience.unique()

array([1, 0], dtype=int64)

In [96]:
q2_tab = pd.crosstab(index=q2['target'], columns=q2['relevent_experience'])
q2_tab

relevent_experience    0    1
target
0                    213  907
1                    143  237

In [97]:
import scipy.stats as sc

In [99]:
q2_out = sc.chi2_contingency(q2_tab)
q2_out

(53.28695729305807,
 2.882138021971537e-13,
 1,
 array([[265.81333333, 854.18666667],
        [ 90.18666667, 289.81333333]]))

### 해설

In [102]:
from scipy.stats import chi2_contingency

In [103]:
df_q2 = \
df.loc[(df["major_discipline"] == "STEM") & 
       (df["city_development_index"] > df["city_development_index"].quantile(0.85))]

In [108]:
df_q2

,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target
6,0.939,Female,1,0,Graduate,STEM,9,5,148,0
14,0.939,Male,1,0,Masters,STEM,20,1,73,0
20,0.925,Male,1,0,Masters,STEM,16,2,8,0
38,0.925,Male,1,0,Graduate,STEM,15,4,108,0
56,0.939,Male,0,0,Graduate,STEM,3,2,109,0
...,...,...,...,...,...,...,...,...,...,...
1428,0.926,Male,0,0,Masters,STEM,20,5,15,0
1448,0.923,Female,1,0,Graduate,STEM,20,2,56,1
1468,0.925,Male,0,1,Graduate,STEM,3,2,13,0
1469,0.939,Female,0,1,Graduate,STEM,9,0,9,1
1480,0.923,Female,1,0,Masters,STEM,12,1,81,0

In [107]:
df[(df["major_discipline"] == "STEM") & 
   (df["city_development_index"] > df["city_development_index"].quantile(0.85))]

,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,last_new_job,training_hours,target
6,0.939,Female,1,0,Graduate,STEM,9,5,148,0
14,0.939,Male,1,0,Masters,STEM,20,1,73,0
20,0.925,Male,1,0,Masters,STEM,16,2,8,0
38,0.925,Male,1,0,Graduate,STEM,15,4,108,0
56,0.939,Male,0,0,Graduate,STEM,3,2,109,0
...,...,...,...,...,...,...,...,...,...,...
1428,0.926,Male,0,0,Masters,STEM,20,5,15,0
1448,0.923,Female,1,0,Graduate,STEM,20,2,56,1
1468,0.925,Male,0,1,Graduate,STEM,3,2,13,0
1469,0.939,Female,0,1,Graduate,STEM,9,0,9,1
1480,0.923,Female,1,0,Masters,STEM,12,1,81,0

In [104]:
chi2_contingency(pd.crosstab(df_q2["relevent_experience"], df_q2["target"]))

(0.22142211039568746,
 0.6379584714909265,
 1,
 array([[31.3862069,  5.6137931],
        [91.6137931, 16.3862069]]))

In [105]:
stat, p, dof, exp_v = \
chi2_contingency(pd.crosstab(df_q2["relevent_experience"], df_q2["target"]))

In [106]:
round(p, 2)

0.64

In [ ]:
# (정답) 0.64

## 3.

In [ ]:
# =============================================================================
# 3.(Dataset_13_train.csv를 활용하여) 인사팀에서는 어떤 직원이 이직 의사를 가지고 있을지
# 사전에 파악하고 1:1 면담 등 집중 케어를 하고자 한다. 이를 위해 의사결정 나무를
# 활용하여 모델을 생성하고 그 정확도를 확인하시오.
# - target을 종속변수로 하고 나머지 변수 중 String이 아닌 변수를 독립변수로 한다.
# - 학습은 전부 기본값으로 실시한다.
# - 평가는 "Dataset_13_test.csv" 데이터로 실시한다.
# - 정확도는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
# 
# =============================================================================

# (참고)
# from sklearn.tree import DecisionTreeClassifier
# random_state = 123

### 해설

In [109]:
from sklearn.tree import DecisionTreeClassifier

In [110]:
x_var = df.columns[df.dtypes != 'object'].drop('target')

In [112]:
dt = DecisionTreeClassifier(random_state=123).fit(df[x_var], df['target'])

In [114]:
test = pd.read_csv('Dataset/Dataset_13_test.csv')

In [115]:
dt.score(test[x_var], test['target'])

0.672

In [ ]:
# (정답) 0.67

# Dataset_14

In [ ]:
# =============================================================================
# =============================================================================
# # 문제 14 유형(DataSet_14.csv 이용)
#
# 구분자 : comma(“,”), 2000 Rows, 9 Columns, UTF-8 인코딩
#
# 온라인 교육업체 싱글캠퍼스에서 런칭한 교육 플랫폼을 보다
# 체계적으로 운영하기 위해 2014년부터 2016년 동안 개설된 강좌
# 2000개를 대상으로 강좌 실적 및 고객의 서비스 분석을 실시하려고
# 한다. 관련 데이터는 다음과 같다.
#
# 컬 럼 / 정 의 / Type
# id / 강좌 일련번호 / Double
# published / 강좌 개설일 / String
# subject / 강좌 대주제 / String
# level / 난이도 / String
# price / 가격(만원) / Double
# subscribers / 구독자 수(결제 인원) / Double
# reviews / 리뷰 개수 / Double
# lectures / 강좌 영상 수 / Double
# duration / 강좌 총 길이(시간) / Double
# =============================================================================
# =============================================================================

## 1.

In [ ]:
# =============================================================================
# 1.결제 금액이 1억 이상이면서 구독자의 리뷰 작성 비율이 10% 이상인 교육의 수는?
# - 결제 금액은 강좌 가격에 구독자 수를 곱한 값이다.
# - 리뷰 작성 비율은 리뷰 개수에 구독자 수를 나눈 값이다. (답안 예시) 1
# =============================================================================

In [ ]:
# 단위 고려

## 2.

In [ ]:
# =============================================================================
# 2.강좌 가격이 비쌀수록 구독자 숫자는 줄어든다는 가설을 확인하기 위해 상관분석을
# 실시하고자 한다. 2016년 개설된 Web Development 강좌를 대상으로 강좌 가격과
# 구독자 수의 피어슨 상관관계를 기술하시오.
# - 상관계수는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
# =============================================================================

In [ ]:
# 필터링 후 상관계수

In [ ]:
# 날짜.dt.year

## 3.

In [ ]:
# =============================================================================
# 3.유저가 서비스 사용에 익숙해지고 컨텐츠의 좋은 내용을 서로 공유하려는 경향이
# 전반적으로 증가하는 추세라고 한다. 이를 위해 먼저 강좌 개설 년도별 구독자의 리뷰
# 작성 비율의 평균이 강좌 개설 년도별로 차이가 있는지 일원 분산 분석을 통해서
# 알아보고자 한다. 이 때 검정통계량을 기술하시오.
# - 검정통계량은 반올림하여 소수점 첫째 자리까지 기술하시오. (답안 예시) 0.1
#
# (참고)
# from statsmodels.formula.api import ols
# from statsmodels.stats.anova import anova_lm
# =============================================================================

# Dataset_15

In [ ]:
# =============================================================================
# =============================================================================
# # 문제 15 유형(Dataset_05_Mart_POS.csv /  이용)
#
# =============================================================================
# Dataset_05_Mart_POS.csv 
# 구분자 : comma(“,”), 20488 Rows, 3 Columns, UTF-8 인코딩
# =============================================================================
#
# 원룸촌에 위치한 A마트는 데이터 분석을 통해 보다 체계적인 재고관리와
# 운영을 하고자 한다. 이를 위해 다음의 두 데이터 세트를 준비하였다.
#
# 컬 럼 / 정 의 / Type
# Member_number / 고객 고유 번호 / Double
# Date / 구매일 / String
# itemDescription / 상품명 / String

# =============================================================================
# Dataset_05_item_list.csv 
# 구분자 : comma(“,”), 167 Rows, 4 Columns, UTF-8 인코
# =============================================================================
#
# 컬 럼 / 정 의 / Type
# prod_id / 상품 고유 번호 / Double
# prod_nm / 상품명 / String
# alcohol / 주류 상품 여부(1 : 주류) / Integer
# frozen / 냉동 상품 여부(1 : 냉동) / Integer
# =============================================================================
# =============================================================================

## 1.

In [ ]:
# =============================================================================
# 1.(Dataset_05_Mart_POS.csv를 활용하여) 가장 많은 제품이 팔린 날짜에 가장 많이 팔린
# 제품의 판매 개수는? (답안 예시) 1
# =============================================================================

### 해설

In [116]:
import pandas as pd

In [127]:
pos = pd.read_csv('Dataset/Dataset_05_Mart_POS.csv')
list1 = pd.read_csv('Dataset/Dataset_05_item_list.csv')

In [118]:
pos.head()

   Member_number        Date itemDescription
0           1220  2015-01-01     canned beer
1           1220  2015-01-01       margarine
2           1220  2015-01-01       chocolate
3           1235  2015-01-01         sausage
4           1235  2015-01-01         sausage

In [119]:
pos.value_counts()

Member_number  Date        itemDescription
1994           2015-03-11  whole milk          4
3055           2015-08-18  other vegetables    3
4843           2015-05-13  whole milk          3
3679           2015-12-23  domestic eggs       3
2736           2015-03-02  whole milk          3
                                              ..
2364           2015-06-21  napkins             1
                           coffee              1
                           UHT-milk            1
               2015-05-11  white bread         1
5000           2015-02-10  soda                1
Length: 19981, dtype: int64

In [120]:
pos['Date'].value_counts()

2015-01-21    96
2015-07-21    93
2015-08-08    92
2015-11-29    92
2015-04-30    91
              ..
2015-11-05    29
2015-12-21    29
2015-03-17    23
2015-03-16    23
2015-09-01    22
Name: Date, Length: 364, dtype: int64

In [121]:
q1_ans = pos['Date'].value_counts().nlargest(1)
q1_ans

2015-01-21    96
Name: Date, dtype: int64

In [ ]:
# (정답) 96

## 2.

In [ ]:
# =============================================================================
# 2. (Dataset_05_Mart_POS.csv, Dataset_05_item_list.csv를 활용하여) 고객이 주류 제품을
# 구매하는 요일이 다른 요일에 비해 금요일과 토요일이 많을 것이라는 가설을 세웠다. 
# 이를 확인하기 위해 금요일과 토요일의 일별 주류제품 구매 제품 수 평균과 다른
# 요일의 일별 주류제품 구매 제품 수 평균이 서로 다른지 비교하기 위해 독립 2표본
# t검정을 실시하시오. 
# 해당 검정의 p-value를 기술하시오.
# - 1분기(1월 ~ 3월) 데이터만 사용하여 분석을 실시하시오.
# - 등분산 가정을 만족하지 않는다는 조건 하에 분석을 실시하시오.
# - p-value는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
# =============================================================================

### 해설

In [ ]:
# 1. 데이터셋 결합
# 2. 요일
# 3. 1 분기 데이터 필터링(월 단위 추출)

In [122]:
q2 = pos.copy()

In [123]:
q2.dtypes

Member_number       int64
Date               object
itemDescription    object
dtype: object

In [162]:
q2.Date

0        2015-01-01
1        2015-01-01
2        2015-01-01
3        2015-01-01
4        2015-01-01
            ...
20483    2015-12-30
20484    2015-12-30
20485    2015-12-30
20486    2015-12-30
20487    2015-12-30
Name: Date, Length: 20488, dtype: object

In [130]:
# https://pandas.pydata.org/docs/reference/series.html#accessors
# https://pandas.pydata.org/docs/reference/series.html#api-series-dt

In [133]:
pd.to_datetime(q2.Date).dt.year

0        2015
1        2015
2        2015
3        2015
4        2015
         ...
20483    2015
20484    2015
20485    2015
20486    2015
20487    2015
Name: Date, Length: 20488, dtype: int64

In [135]:
pd.to_datetime(q2.Date).dt.month

0         1
1         1
2         1
3         1
4         1
         ..
20483    12
20484    12
20485    12
20486    12
20487    12
Name: Date, Length: 20488, dtype: int64

In [167]:
pd.to_datetime(q2.Date).dt.day_name

In [166]:
pd.to_datetime(q2.Date).dt.weekday

0        3
1        3
2        3
3        3
4        3
        ..
20483    2
20484    2
20485    2
20486    2
20487    2
Name: Date, Length: 20488, dtype: int64

In [171]:
# locale 지정 -> but 깨짐 폰트 문제?
# pd.to_datetime(q2.Date).dt.day_name(locale='ko_kr') # -> 실패
# pd.to_datetime(q2.Date).dt.day_name(locale='ko_KR.UTP-8') # -> 실패
# pd.to_datetime(q2.Date).dt.day_name(locale='ko_KR') # -> 실패

0        ¸ñ¿äàï
1        ¸ñ¿äàï
2        ¸ñ¿äàï
3        ¸ñ¿äàï
4        ¸ñ¿äàï
          ...
20483    ¼ö¿äàï
20484    ¼ö¿äàï
20485    ¼ö¿äàï
20486    ¼ö¿äàï
20487    ¼ö¿äàï
Name: Date, Length: 20488, dtype: object

In [156]:
# pd.to_datetime(q2.Date).dt.day_name(locale='ko_kr')

0        ¸ñ¿äàï
1        ¸ñ¿äàï
2        ¸ñ¿äàï
3        ¸ñ¿äàï
4        ¸ñ¿äàï
          ...
20483    ¼ö¿äàï
20484    ¼ö¿äàï
20485    ¼ö¿äàï
20486    ¼ö¿äàï
20487    ¼ö¿äàï
Name: Date, Length: 20488, dtype: object

In [182]:
q2['month'] = pd.to_datetime(q2.Date).dt.month
# q2['day'] = pd.to_datetime(q2.Date).dt.day_name(locale='ko_kr')
q2['day'] =pd.to_datetime(q2.Date).dt.weekday

In [183]:
q2_merge = pd.merge(q2, list1, 
                    left_on = 'itemDescription', 
                    right_on='prod_nm', 
                    how='left')
q2_merge

,Member_number,Date,itemDescription,month,day,prod_id,prod_nm,alcohol,frozen
0,1220,2015-01-01,canned beer,1,3,25,canned beer,1,0
1,1220,2015-01-01,margarine,1,3,70,margarine,0,0
2,1220,2015-01-01,chocolate,1,3,14,chocolate,0,0
3,1235,2015-01-01,sausage,1,3,19,sausage,0,0
4,1235,2015-01-01,sausage,1,3,19,sausage,0,0
...,...,...,...,...,...,...,...,...,...
20483,4058,2015-12-30,cream cheese,12,2,60,cream cheese,0,0
20484,4565,2015-12-30,canned beer,12,2,25,canned beer,1,0
20485,4565,2015-12-30,canned beer,12,2,25,canned beer,1,0
20486,4863,2015-12-30,dessert,12,2,51,dessert,0,0
20487,4863,2015-12-30,curd,12,2,45,curd,0,0

In [184]:
q2_merge['week'] = 0
# q2_merge.loc[q2_merge.day.isin(['금요일', '토요일']), 'week'] = 1
q2_merge.loc[q2_merge.day.isin([4, 5]), 'week'] = 1

In [185]:
q2_2 = q2_merge[q2_merge.month.isin([1, 2, 3])]

In [186]:
q2_tab = pd.pivot_table(q2_2, index='Date', columns='week', 
                        values='alcohol', 
                        aggfunc='sum')

In [187]:
from scipy.stats import ttest_ind

In [188]:
ttest_ind(q2_tab[1].dropna(), q2_tab[0].dropna(), equal_var=False)

Ttest_indResult(statistic=-2.335264239960428, pvalue=0.023062611047582393)

In [ ]:
# (정답) 0.02(이분산) / 0.04(등분산)

## 3.

In [ ]:
# =============================================================================
# 3.(Dataset_05_Mart_POS.csv를 활용하여) 1년 동안 가장 많이 판매된 10개 상품을 주력
# 상품으로 설정하고 특정 요일에 프로모션을 진행할지 말지 결정하고자 한다. 먼저
# 요일을 선정하기 전에 일원 분산 분석을 통하여 요일별 주력 상품의 판매 개수의
# 평균이 유의미하게 차이가 나는지 알아보고자 한다. 이와 관련하여 일원 분산 분석을
# 실시하고 p-value를 기술하시오.
# - p-value는 반올림하여 소수점 둘째 자리까지 기술하시오. (답안 예시) 0.12
# 
# (참고)
# from statsmodels.formula.api import ols
# from statsmodels.stats.anova import anova_lm
# =============================================================================

### 해설

In [ ]:
# 전처리 난이도 상

In [143]:
pos.columns

Index(['Member_number', 'Date', 'itemDescription'], dtype='object')

In [144]:
top10 = pos['itemDescription'].value_counts().nlargest(10).index
top10

Index(['whole milk', 'other vegetables', 'rolls/buns', 'sausage', 'soda',
       'yogurt', 'tropical fruit', 'root vegetables', 'citrus fruit',
       'frankfurter'],
      dtype='object')

In [145]:
q3 = q2[q2['itemDescription'].isin(top10)]

In [149]:
q3_tab = pd.pivot_table(data=q3, 
                        index=['Date', 'day'], 
                        values='itemDescription', 
                        aggfunc='count').reset_index()
q3_tab

           Date     day  itemDescription
0    2015-01-01  ¸ñ¿äàï               16
1    2015-01-02  ±ý¿äàï               13
2    2015-01-03  Åä¿äàï               28
3    2015-01-04  Àï¿äàï               21
4    2015-01-05  ¿ù¿äàï               30
..          ...     ...              ...
359  2015-12-26  Åä¿äàï               11
360  2015-12-27  Àï¿äàï               31
361  2015-12-28  ¿ù¿äàï               21
362  2015-12-29  È­¿äàï               27
363  2015-12-30  ¼ö¿äàï               18

[364 rows x 3 columns]

In [146]:
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm

In [152]:
ols1 = ols('itemDescription~day', q3_tab).fit()

In [154]:
q3_out = anova_lm(ols1)
q3_out

             df        sum_sq    mean_sq        F    PR(>F)
day         6.0    219.527473  36.587912  0.86853  0.518128
Residual  357.0  15039.076923  42.126266      NaN       NaN

In [155]:
q3_out['PR(>F)'][0]

0.5181278037418005

In [ ]:
# (정답) 0.52